# Exercise
### We want to determine the following:

What is the total number of entries in the dataset?

What are the earliest and latest years for which we have data?

How many countries are included in this dataset?

What is the average percentage of people who have access to managed drinking water services across all years and all countries included in our dataset?

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql mysql+pymysql://root:****1@localhost:3306/united_nations

In [8]:
%%sql

##total number of entries in dataset
SELECT 
    count(*) AS total_number_of_entries
FROM
    access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(1048,)]

In [11]:
%%sql

SELECT 
    *
FROM
    access_to_basic_services
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2015, Decimal('94.67'), Decimal('98.00'), Decimal('17.542806'), Decimal('184.39'), Decimal('2699700.00'), Decimal('4.93'))]

In [12]:
%%sql

##earliest and latest years
SELECT 
    count(*) AS total_number_of_entries,
    MIN(time_period) AS earilest_record,
    MAX(time_period) AS latest_record
FROM
    access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(1048, 2015, 2020)]

In [13]:
%%sql

##number of countries
SELECT 
    count(*) AS total_number_of_entries,
    MIN(time_period) AS earilest_record,
    MAX(time_period) AS latest_record,
    COUNT(DISTINCT country_name) AS number_of_countries
FROM
    access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(1048, 2015, 2020, 182)]

In [17]:
%%sql

##Average Access To Managed Water Services
SELECT 
    count(*) AS total_number_of_entries,
    MIN(time_period) AS earilest_record,
    MAX(time_period) AS latest_record,
    COUNT(DISTINCT country_name) AS number_of_countries,
    ROUND(AVG(Pct_managed_drinking_water_services),0) AS average_access_to_managed_water_services
FROM
    access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(1048, 2015, 2020, 182, Decimal('87'))]

# Exercise
### Northwind DB

In [1]:
%load_ext sql

In [4]:
%sql sqlite:///Northwind.db

### Exercise 1
Display the average unit price of products in the `Products` table.

In [46]:
%%sql

SELECT
    productname,
    unitprice
FROM
    products
LIMIT 10;

   sqlite:///Northwind
 * sqlite:///Northwind.db
Done.

[('Chai', 18),
 ('Chang', 19),
 ('Aniseed Syrup', 10),
 ("Chef Anton's Cajun Seasoning", 22),
 ("Chef Anton's Gumbo Mix", 21.35),
 ("Grandma's Boysenberry Spread", 25),
 ("Uncle Bob's Organic Dried Pears", 30),
 ('Northwoods Cranberry Sauce', 40),
 ('Mishi Kobe Niku', 97),
 ('Ikura', 31)]

### Exercise 2
Show the total quantity of products sold for each `ProductID`

In [45]:
%%sql

SELECT
    products.productname,
    products.unitprice,
    SUM(quantity) AS TotalQuantity
FROM
    products
JOIN
    orderdetails ON orderdetails.productid=products.productid
GROUP BY
    products.productname
LIMIT 10;

   sqlite:///Northwind
 * sqlite:///Northwind.db
Done.

[('Alice Mutton', 39, 978),
 ('Aniseed Syrup', 10, 328),
 ('Boston Crab Meat', 18.4, 1103),
 ('Camembert Pierrot', 34, 1577),
 ('Carnarvon Tigers', 62.5, 539),
 ('Chai', 18, 828),
 ('Chang', 19, 1057),
 ('Chartreuse verte', 18, 793),
 ("Chef Anton's Cajun Seasoning", 22, 453),
 ("Chef Anton's Gumbo Mix", 21.35, 298)]

### Exercise 3
Find the maximum, minimum, and average freight.

In [17]:
%%sql

SELECT
    MAX(Freight	) AS MaxFreight,
    MIN(Freight	) AS MinFreight,
    AVG(Freight	) AS AvgFreight
FROM
    orders;

   sqlite:///Northwind
 * sqlite:///Northwind.db
Done.

[(1007.64, 0.02, 78.24420481927719)]

### Exercise 4
How many unique customers have made orders?

In [20]:
%%sql

SELECT
    COUNT(DISTINCT customerid) AS NumberofUniqueCustomers
FROM 
    orders;

   sqlite:///Northwind
 * sqlite:///Northwind.db
Done.

[(89,)]

### Exercise 5
What is the total price for each order?

In [47]:
%%sql

SELECT
    orderid,
    ROUND(SUM(orderdetails.unitprice*quantity*(1-discount)),2) AS TotalPrice
FROM
    OrderDetails
GROUP BY
    orderid
LIMIT 10;

   sqlite:///Northwind
 * sqlite:///Northwind.db
Done.

[(10248, 440.0),
 (10249, 1863.4),
 (10250, 1813.0),
 (10251, 670.8),
 (10252, 3730.0),
 (10253, 1444.8),
 (10254, 625.2),
 (10255, 2490.5),
 (10256, 517.8),
 (10257, 1119.9)]

### Challenge question
What are the 5 largest orders processed?

In [42]:
%%sql

SELECT
    orderid,
    ROUND(SUM(orderdetails.unitprice*quantity*(1-discount)),2) AS TotalPrice
FROM
    OrderDetails
GROUP BY
    orderid 
ORDER BY 
    TotalPrice DESC
LIMIT 5;

   sqlite:///Northwind
 * sqlite:///Northwind.db
Done.

[(10865, 17250.0),
 (11030, 16321.9),
 (10981, 15810.0),
 (10372, 12281.2),
 (10424, 11493.2)]

# Exercise